[
  {
    "slug": "climate-change",
    "title": "China’s Climate Action",
    "date": "2025-04-01T04:00:00.000Z",
    "excerpt": "China’s Climate Action - Coal Paradox, Clean Energy Surge, and Global Implications",
    "content": "## Introduction\n\nClimate change poses an urgent global challenge, prompting major emitters like China and the United States to announce bold pledges (China aims for carbon neutrality by 2060, the U.S. by 2050). Yet skepticism abounds about whether these promises are being backed by real action on the ground. For instance, China continues to invest in new coal power even as it rapidly builds renewable energy, raising questions about the sincerity of its climate commitment. Similarly, the U.S. touts clean energy growth but faces critiques over stagnation in nuclear power and other missed opportunities. This report examines China’s recent climate and energy actions – in electrification, renewables (solar, wind, hydro), energy storage, and infrastructure – to assess if China is substantively moving toward its 2060 carbon-neutral goal. It then compares China’s progress and approach with that of the U.S., highlighting differences in renewable deployment, electrification (such as electric vehicles), and the role of nuclear energy. We discuss missed opportunities (particularly in U.S. nuclear strategy) and how the U.S. could adopt a more effective, economically feasible strategy. Finally, we consider the global context, focusing on developing nations’ roles in future emissions and strategies to enable their growth on a low-carbon path – noting, for example, China’s role in making solar power affordable worldwide. Throughout, we reference debates in climate policy discourse, including critiques of Bjørn Lomborg’s _False Alarm_ and David Wallace-Wells’ _The Uninhabitable Earth_, to ground our analysis in a realistic, evidence-based approach to climate action.\n\n## China’s Climate Goals and the Coal Dilemma\n\nChina’s top-level climate goals are clear: _peak_ carbon emissions by 2030 and achieve _carbon neutrality_ by 2060. These were formally announced in 2020 and reiterated in China’s nationally determined contributions. In pursuit of these goals, China has set interim targets such as increasing the share of non-fossil energy in primary consumption to 25% by 2030 and installing 1,200 GW of wind and solar capacity by 2030 ([1]). However, a major point of skepticism is China’s continued expansion of coal-fired power. Observers note a “coal paradox”: even as China pledges to phase down coal usage after 2025, it has been approving and building new coal power plants at a rapid clip ([2]) ([3]).\n\nIndeed, Chinese authorities permitted **a record 106 GW of new coal power capacity in 2022**, roughly equivalent to two large coal plants per week ([4]). This was a fourfold jump from the prior year’s permits and the highest level since 2015. The surge continued into 2023, with another wave of project approvals and construction starts. By the first half of 2024, coal plant proposals began to ease (only ~9 GW permitted in H1 2024, an 83% drop year-on-year) ([5]) ([3]), but overall 2024 still saw **66.7 GW of new coal capacity approved and a staggering 94.5 GW start construction**, the most new builds in a year since 2015 ([3]) ([6]).\n\n![Graph of progress of new coal power projects and retirements in China](https://cdn.dhugs.com/thumbnails/climate-change.avif)\n\n([7]) _Figure: Progress of new coal power projects and retirements in China (2015–2024). Bars show half-yearly changes in coal plant status: **Permitted** (red), **Construction started/restarted** (orange), **Commissioned** (black), and **Retired** (blue). Coal project permits spiked dramatically in 2022–2023, reaching levels not seen since the mid-2010s, before slowing in 2024 ([8])._\n\nThese trends understandably fuel skepticism. How can China be “serious” about climate neutrality while apparently locking in more coal capacity? Chinese officials argue that many of these new coal plants are intended for grid stability and peak power provision – a _“supporting” role_ as renewables fluctuate – rather than for baseload growth in coal consumption ([9]) ([10]). In theory, if China’s expansion of wind, solar, and nuclear continues to **outpace electricity demand growth**, then coal-fired generation can peak and even decline **despite** new plants. President Xi Jinping has pledged to _“strictly control”_ coal growth through 2025 and start reducing coal use in the 2026–2030 period ([11]). Achieving this will likely mean many coal plants run at low capacity factors (operating as reserve or backup units). In fact, average utilization of China’s coal power fleet has already fallen well below design levels (~4,000 hours/year vs. 5,500 optimal) as grids prioritize cleaner power when available ([12]). Some experts therefore interpret the coal build-out as a _belt-and-suspenders_ policy – building extra coal capacity as insurance for reliability, even while intending to rely mostly on new clean generation ([10]).\n\nHowever, there are real risks that this “coal insurance” could become a crutch. Analysts warn that adding so much new coal, often pushed by local governments and state-owned power firms, **could slow the transition** if those actors then resist retiring or curtailing coal use to protect their investments ([13]) ([14]). The worst-case scenario is that China’s massive clean energy build-out gets _“layered on top of”_ an entrenched coal base instead of replacing it ([15]) ([16]). Already, there are signs of stress: in late 2024, China’s solar and wind output faced unexpected curtailment (utilization drops) even as coal power remained strong, indicating grid integration struggles ([17]). This parallel expansion of coal and renewables has led observers to quip that China’s current strategy looks more like **“energy addition” rather than energy transition** ([18]). Hundreds of brand-new coal plants could complicate hitting emission targets, as they create political and economic inertia against phasing down coal ([13]) ([14]). Meeting China’s climate commitments, therefore, will require not just _building_ clean energy, but also policy resolve to rein in coal use—through market reforms, grid upgrades, and perhaps early retirements or low utilization mandates for those coal plants once clean capacity is firmly established. In short, China faces a coal dilemma: it is investing in coal to shore up energy security and grid reliability in the short term, even as it simultaneously invests in an unprecedented scale-up of zero-carbon energy to fulfill its long-term climate goals.\n\n## Unprecedented Surge in Clean Energy and Electrification\n\nWhile coal headlines draw concern, they should not overshadow the remarkable progress China has made since 2020 in scaling up renewable energy, electrifying transport, and building new energy infrastructure. By many metrics, China’s clean energy transition is accelerating at a record-shattering pace – arguably **the fastest and largest in the world**. Key indicators of China’s energy transformation in recent years are summarized in **Table 1**.\n\n**Table 1: Key Indicators of China’s Energy Transition – 2020 vs 2024**\n\n| Indicator (end of year)                                             | 2020[19] | 2024[20]                                                                                                        |\n| ------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| **Installed Solar Capacity**                                        | 281.5 GW​                                                                                                                                                | 886.7 GW​                                                                                                                                                                                                                    |\n| **Installed Wind Capacity**                                         | 253.4 GW​                                                                                                                                                | 520 GW​                                                                                                                                                                                                                      |\n| **Wind + Solar Total**                                              | ~535 GW                                                                                                                                                  | ~1,407 GW (≈1.4 TW)​                                                                                                                                                                                                         |\n| **New Solar Added (that year)**                                     | 48.2 GW (rebound after 2-year dip)​                                                                                                                      | 277 GW (all-time record)​ - [21]                                                  |\n| **New Wind Added (that year)**                                      | 71.7 GW (record high)​                                                                                                                                   | ~93 GW (approx., very high)                                                                                                                                                                                                  |\n| **Electric Vehicles Sold**                                          | 1.27 million (≈6% of new car sales)​ -  [22]                         | 8.1 million (>33% of new car sales)​ - [23]                                                                                                 |\n| **“New” Energy Storage Installed**<br>(batteries & other non-hydro) | ~3 GW (est., modest base)                                                                                                                                | 31.4 GW​ - [24] (met 2025 target 2 years early) |\n| Clean Power Share of Generation                                     | ~29% (non-fossil electricity)                                                                                                                            | 44% (record high as of May 2024)​ - [25]                                               |\n\n_Sources:_ National Energy Administration of China (capacity data), IEA Global EV Outlook 2024 (EV sales) ([26]), Carbon Brief ([25]), CREA, Reuters, InsideEVs, etc.\n\nAs shown above, China’s installed solar and wind power capacity has **skyrocketed**. By the end of 2024, China had about **1.4 **terawatts** (1,407 GW) of wind and solar capacity** in place ([27]) ([28]), more than _double_ the ~535 GW it had in 2020 ([29]). In other words, China achieved in four years what it initially thought would take a decade: Beijing had set a goal for 1,200 GW of wind+solar by 2030, but reached this milestone six years ahead of schedule ([30]). This is an immense achievement. In 2023 alone, China added **301 GW of renewable power capacity (solar, wind, hydro)** ( [31] )—which was more generation capacity than most countries have ever built in their history. For perspective, China in a single year installed about as much new renewable capacity as the **entire** United States has in total. In fact, in 2022 China added roughly as much solar capacity as the rest of the world combined, then _doubled_ its new solar additions in 2023 ([32]). By 2024, China’s annual solar installations (over 200 GW) dwarf those of any other nation, reflecting a breakneck pace of deployment. Wind power has also grown fast (a record 72 GW added in 2020 ([33]), with high additions continuing thereafter), though solar has been the standout leader recently.\n\nCorrespondingly, the share of clean electricity in China’s generation mix has been rising. As of spring 2024, **clean energy (renewables + nuclear) provided about 44% of China’s electricity** ( [25] ), a jump from roughly one-third a few years ago. Fossil fuels now make up less than half of China’s installed power capacity – a dramatic change from a decade ago when coal dominated with ~70% of capacity ([34]). If current trends persist, China’s power sector emissions are expected to _peak by 2025_ as renewable generation growth meets all new demand ([35]), allowing coal output to plateau. Greenpeace analysts note that in 2025, renewable power could potentially cover **100% of China’s increase in electricity demand**, which _“would pave the way for China’s power sector to achieve peak emissions by 2025.”_ ([35]) Meeting that near-term peak in the power sector is critical for the longer goal of carbon neutrality by 2060.\n\n### Renewable Energy Deployment and Industrial Scale-Up\n\nUnderpinning this clean energy surge are concerted policies and massive investments in renewable energy. Every Five-Year Plan since 2005 has incorporated expanding renewables, but the current 14th Five-Year Plan (2021–2025) greatly raised ambitions, mandating aggressive capacity additions. China’s state-owned power companies – like SPIC, China Energy, and Huaneng – have poured resources into both utility-scale renewables and distributed (rooftop) solar to meet government targets ([36]). **Solar PV costs have plummeted**, helped by China’s scale: between 2020 and 2024, the price of solar modules in China fell by ~60% (from ¥2.0/W to ¥0.7/W) due to collapsing polysilicon prices and economies of scale ([37]) ([38]). By flooding the market with cheap panels, China has driven down solar costs globally. In 2023, an oversupply of Chinese-made panels pushed prices **42% lower** in that year alone ([39]). Chinese panels are now _over 60% cheaper_ than U.S.- or European-made ones ([39]). This price drop greatly improves the economics of solar farms, both domestically and worldwide, validating China’s strategy of scaling up manufacturing. (It has also triggered trade tensions – e.g., tariffs – as Western producers struggle to compete with China’s subsidized industry ([40]) ([41]). But from a climate perspective, China’s “cheap solar” policy is a boon, making clean energy more affordable in developing and developed countries alike.) By end of 2023, China’s solar manufacturing capacity was an astronomical 861 GW per year, about **double** the entire world’s annual installations ([42]). In essence, China can now produce enough panels in one year to equip several years’ worth of global solar demand – a clear result of industrial policy that sought global dominance in renewables manufacturing.\n\nWind power has similarly benefited from scale and technology development. China has built large onshore wind bases and the most offshore wind capacity of any country. After a subsidy-driven rush in 2020 (72 GW added) ([33]), additions dipped slightly then rebounded. Chinese firms also lead in wind turbine production. Additionally, China has continued expanding **hydropower**, already the largest in the world (with big projects like the 16-GW Baihetan dam commissioned in 2021–22). As a result of all this, in 2023 China’s clean electricity investment and installation rates were aligned with or even exceeding benchmarks for a 1.5°C climate scenario ([43]). The Centre for Research on Energy and Clean Air (CREA) concluded that **record clean energy additions in 2023 have brought China’s emissions peak much closer**, and if China can sustain the 2023–24 level of build-out, it will achieve peaking and then begin reducing emissions in the coming years ([43]) ([44]).\n\nHowever, deploying renewables at such a blistering pace has brought challenges, particularly in grid integration and potential overcapacity in manufacturing. By late 2024, there were signs of _temporary_ oversupply: solar and wind output sometimes had to be curtailed (wasted) because the grid couldn’t absorb all of it, and utilization rates of new renewables fell in some quarters ([17]). China’s solution is a sweeping effort to upgrade and transform its power infrastructure.\n\n### Energy Storage and Grid Infrastructure Transformation\n\nTo make intermittent renewables reliable, China has massively ramped up **energy storage** and ultra-high-voltage transmission infrastructure. This is a less-publicized but crucial part of its climate strategy. As of 2023, China had over **50 GW of pumped hydro storage** in operation – more than any other country (about 30% of global pumped storage) ([45]). In addition, the country is witnessing a boom in “new type” energy storage, mainly large-scale lithium battery stations. The capacity of battery and other non-hydro storage in China _quadrupled_ in 2023 **from ~8.7 GW to 31.4 GW** ( [24] ), reaching a planned 30 GW target two years ahead of schedule. This extraordinary growth means China now leads the world in battery storage deployment as well ( [46] ) ( [47] ). By the end of 2024, total installed _new energy storage_ (batteries, etc.) was reported at about 74 GW (168 GWh) ([48]) – a twentyfold increase since 2021. These storage systems help buffer the variability of solar and wind, storing excess power and releasing it at night or during peak demand.\n\nPolicy has driven this storage surge. Since 2017, China has enforced a **“renewables + storage” mandate** for many new wind and solar projects, requiring developers to include a certain percentage (5–20%) of storage capacity alongside new renewable plants ( [49] ). This has effectively made large battery installations routine, jump-starting a market for grid storage. Although some of these batteries are currently underused (utilization lags installation), their presence strengthens grid stability and signals a long-term commitment to making renewables dispatchable ( [50] ) ( [24] ). Alongside chemical batteries, China is experimenting with emerging storage tech like compressed air, flywheels, and thermal storage ( [51] ) ( [52] ), aiming to diversify its options.\n\nOn the transmission side, China has built an extensive network of **ultra-high-voltage (UHV) power lines** crisscrossing the country. These UHV lines (±800 kV DC and 1,000 kV AC lines) allow transporting electricity over thousands of kilometers with minimal losses. They connect the remote, renewables-rich regions (sunny deserts of the northwest, windy plains, mountainous hydro sites) to the eastern megacities where power demand is highest. State Grid Corporation’s ongoing grid upgrades are intended to accommodate the rising share of renewables and ease strain from rising demand ([53]) ([54]). In mid-2023, China’s government approved a new three-year plan to modernize the power system, with a focus on enhancing the grid’s ability to integrate renewables and handle peak loads ([28]). This includes smart grid investments, digital grid management, and more inter-provincial transmission capacity.\n\nThe goal of these infrastructure efforts is to realize what Chinese planners call _“建立而后破”_ (“establish before breaking”) – **establish** the new clean energy supply and stable grid **before** **breaking** (phasing out) the old fossil-based system ([18]). In practice, China is clearly excelling at the “establish” part: it is rapidly building the components of a new green energy system (mass renewables, storage, EVs, etc.). The critical next step will be whether it can begin _breaking_ dependence on coal in earnest while maintaining energy security. If the grid and storage can truly substitute for coal’s role in balancing supply and demand, China can confidently retire or idle coal plants. As noted, President Xi has stated coal consumption will start to decline in the second half of this decade ([11]). Achieving that will mark a turning point proving that the new infrastructure is sufficient.\n\n### Electrification of Transport and Other Sectors\n\nBeyond the power sector, China has been aggressively _electrifying end-use sectors_ as part of its climate strategy. The clearest example is transportation. China is now the world’s largest market for electric vehicles, by a wide margin. In 2023, over **8 million new electric cars** (battery-electric or plug-in hybrid) were sold in China ([26]) ([55]). This accounted for **over one-third of all new cars** sold in the country – a jump from just 5–6% EV share in 2020 ([26]) ([56]). China alone made up roughly 60% of global EV sales in 2023 ([26]), selling more EVs than the rest of the world combined. The growth has been explosive: as mentioned, ~1.3 million plug-in vehicles were sold in 2020 ([56]), and that climbed to 8+ million in 2023 (a 35% year-on-year increase from 2022) ([55]). Such momentum continued into 2024 – reports indicate China’s EV sales may have exceeded 12 million in 2024 (including commercial EVs) ([57]). It’s not only private cars: **about 70% of city buses in China are now electric** ([58]), and fleets of electric trucks and delivery vans are also expanding. In many Chinese cities, electric two-wheelers (e-bikes and scooters) are ubiquitous, essentially having replaced gasoline mopeds.\n\nPolicy incentives have played a key role. For years, China offered subsidies and tax breaks for new energy vehicles (NEVs), building domestic champions like BYD, NIO, and XPeng. Charging infrastructure was rolled out rapidly – by 2023 China had over 5 million public EV charging points, including extensive fast-charger networks along highways and in cities. Interestingly, national purchase subsidies for EVs actually **expired at the end of 2022**, yet sales continued to soar in 2023 ([59]), demonstrating that consumer demand had reached self-sustaining levels (helped by a wave of affordable models, e.g. the ~$5,000 Wuling Mini EV, and intense competition driving prices down). China’s EV success has also turned it into the world’s largest auto exporter in 2023, for the first time – it exported 1.2 million EVs abroad that year ([60]). This indicates Chinese EV manufacturers are now scaling beyond the domestic market, challenging Western and Japanese automakers globally.\n\nElectrification in China extends to **high-speed rail and public transit** as well. China has built a vast high-speed rail (HSR) network (>40,000 km of electrified lines), carrying billions of passenger trips that might otherwise have been taken by cars or planes. This has not only modernized transport but also curbed oil use and emissions from aviation on major routes. In urban areas, dozens of Chinese cities have electric metro and light rail systems, and many have entirely electric bus fleets. Additionally, China has programs to promote electrification of heating in northern regions (replacing coal-fired home boilers with electric heat pumps or district heating), and to electrify industrial processes where feasible.\n\nTogether, these electrification moves mean a greater portion of China’s total energy demand is shifting to electricity – which, as we’ve seen, is increasingly generated from clean sources. The **carbon intensity of China’s economy per unit GDP has been falling** in large part due to this twin push: decarbonize power supply and electrify end uses. One study found that China’s EV adoption is on track with a pathway to limit warming to 1.5°C ([[PDF] China's Climate Transition: Outlook 2023](https://energyandcleanair.org/wp/wp-content/uploads/2023/11/CREA_BOELL_Chinas-Climate-Transition-Outlook-2023_EN2.pdf#:~:text=,use%20in%20the%20industrial)), a notable bright spot in transport emissions. Of course, challenges remain in sectors like heavy industry, aviation, or shipping, which are harder to electrify and where China still relies on coal, oil, and gas. Nonetheless, the progress in vehicles and rail is tangible: for example, gasoline demand in China is expected to peak this decade as EVs displace growth, and local air pollution in cities has improved thanks to cleaner transport and heating.\n\n### Is China’s Action Sincere? – Assessing the 2060 Pledge Trajectory\n\nConsidering the evidence, China’s recent actions represent a **remarkable pivot toward a low-carbon economy**, albeit one that coexists uneasily with its legacy coal dependence. On the one hand, the sheer scale of renewables and electrification deployment since 2020 indicates that China’s 2060 carbon neutrality pledge is more than just talk – significant policy, industrial effort, and capital (hundreds of billions of dollars) are being marshaled to transform the energy system. China’s economic model is indeed shifting: in 2023, _clean energy manufacturing and deployment emerged as a key driver of economic growth_, even as traditional real estate construction slowed ([61]). This suggests Beijing sees climate-related industries (solar panels, batteries, EVs, etc.) not only as environmental measures but as strategic sectors for development, jobs, and export markets. Clean energy investments are at record highs and **multiple climate metrics (from EV sales to steel sector emissions)** are _ahead of schedule_ relative to China’s official targets ([62]). In fact, an expert survey in 2023 found that many indicators in China are on track for or exceeding the levels required by ambitious Paris Agreement-aligned scenarios ([62]). All of this supports the view that China is _seriously_ pursuing its climate goals and likely to meet its near-term commitments (like peaking emissions before 2030, possibly well before).\n\nOn the other hand, China’s continued buildout of coal capacity and the absence (so far) of a hard cap on emissions are areas of concern. Total Chinese CO₂ emissions have continued to grow (they **rose ~4% in 2023** to a new high, after a brief dip in 2020) ([63]). This growth is driven by post-pandemic economic activity and some rebound in heavy industry, outpacing the emissions savings from new clean energy in the short term. The net effect is that China’s emissions likely haven’t peaked yet, though the peak has been “brought closer.” Without firm limits, there is a risk that emissions could plateau at a high level for years before declining, which would make the 2060 neutrality challenge steeper (requiring faster cuts later). Put simply, **China is building the means to cut emissions (renewables, etc.), but has not yet chosen to deploy those means to full effect** – as evidenced by the parallel rise in coal infrastructure.\n\nEncouragingly, Chinese leaders have signaled a turning point is imminent. If, as promised, coal consumption begins to decline by 2026 and clean energy keeps its torrid growth, China’s CO₂ emissions could peak by around 2025. Some analyses suggest that the peaking of China’s emissions will likely occur _well before_ 2030 given current trends ([43]). And once peaked, China’s emissions could start a gradual downward trend, accelerating after 2030 as more old coal plants retire and newer technologies like hydrogen, advanced reactors, or carbon capture come into play. Achieving carbon neutrality by 2060 will still be an enormous undertaking (requiring, for example, a near-total decarbonization of industry and transport and/or large-scale carbon removal to offset residual emissions). But the concrete progress this decade – a clean power system taking shape, electrified transport becoming mainstream, domestic innovation in batteries and reactors, etc. – lays a vital foundation. It represents “serious movement” toward the pledge, even if not yet a complete solution.\n\nIn summary, **China is simultaneously the world’s largest CO₂ emitter and its leading provider of climate solutions**. This duality is evident in its actions since 2020. The country’s heavy ongoing coal use invites scrutiny and indeed criticism; however, its unparalleled deployment of renewables and EVs is closing the gap between rhetoric and reality on its climate goals. Whether China ultimately fulfills its 2060 carbon-neutral pledge will depend on policy follow-through in curbing fossil fuels (not just deploying alternatives). But given the strides made in just the past few years, there is increasing confidence – both inside and outside China – that the trajectory can bend downwards. China’s success or failure in this endeavor is _“possibly the single most important factor in the global fight against climate change,”_ as CREA notes ([64]). All indicators suggest China is investing heavily in success.\n\n## China vs. the United States: Contrasting Climate Strategies\n\nChina’s rapid clean energy expansion has often been contrasted with efforts in the United States, the world’s second-largest greenhouse emitter. The U.S. and China have very different political and economic systems, which shape their approaches to climate action. Here we compare their progress and strategies across key dimensions: renewable energy deployment, electrification (especially of transport), and nuclear power, as well as policy frameworks. We also discuss areas where the U.S. may be falling short (with a focus on nuclear energy) and how it might course-correct for a more effective, economically sound transition.\n\n### Renewable Energy Capacity and Investments\n\n**Renewables deployment:** China is outpacing the U.S. by a wide margin in sheer scale of renewable energy installations. As noted, China has about 1.4 TW of wind and solar capacity in 2024 ([27]) ([28]); by comparison, the United States had roughly **0.36 TW (360 GW) of wind and solar** as of 2023 (about one-quarter of China’s level). U.S. wind capacity was ~143 GW and solar ~113 GW by end of 2022, with perhaps ~30 GW of new additions in 2023, bringing totals to ~173 GW wind and ~140 GW solar by end 2023 ([65]) ([66]). Even including other renewables like hydro (~80 GW) and biomass, U.S. total renewable capacity is well under 500 GW – only a third of China’s. The **annual additions** also tell the story: while China added ~300+ GW of renewables in 2023, the U.S. added on the order of 20–30 GW (the exact figure for 2023 isn’t finalized, but it’s nowhere near China’s). This gap partly reflects the difference in energy demand (China’s electricity consumption is ~1.5× the U.S. and growing), but mostly it reflects policy and industry dynamics. China’s state-driven model enabled it to scale manufacturing and deployment quickly, whereas the U.S. has relied more on market mechanisms and tax incentives, which until recently yielded more modest growth.\n\nHowever, **the U.S. is now ramping up efforts** under new policies like the _Inflation Reduction Act (IRA) of 2022_. The IRA provides roughly $370 billion in climate-related funding, largely via tax credits for renewable energy, EVs, batteries, and other clean tech. This is spurring a wave of planned solar, wind, and battery projects in the U.S. For example, solar installations in the U.S. are expected to double over the next five years thanks to the IRA incentives (with annual additions potentially reaching 40–50 GW by the late 2020s). Similarly, wind developers are reviving projects and new offshore wind farms are under development on U.S. coasts. While still slow compared to China, the U.S. trajectory is improving. One analysis found global renewable capacity grew 50% faster in 2023 than the year before largely due to China, _“but also aided by policy support in the U.S. and Europe.”_ ([67]) Notably, the International Energy Agency projects that the _tripling_ of global renewable capacity by 2030 (a target coming out of COP28) will depend heavily on both China _and_ the U.S. meeting their deployment goals.\n\n**Energy mix and emissions:** In terms of current generation, the U.S. had about 22% of its electricity from renewables (including hydro) in 2022, plus ~19% from nuclear, with the rest (~59%) from fossil fuels (mostly gas and some coal). China, as mentioned, reached ~44% from non-fossil (renewables + nuclear) in 2024 ( [25] ). Interestingly, this means China’s electricity mix is now roughly on par with the U.S. in clean vs fossil percentage (the U.S. was ~40% non-fossil in 2022, China ~39% in 2022 and ~44% in 2024). But the U.S. gets a larger share from nuclear and gas, whereas China’s non-fossil share comes more from hydro, wind, solar. China still uses a lot more coal (around 60% of its power) whereas U.S. coal has declined to ~20% of power, replaced largely by natural gas. In absolute emissions, China emits roughly **~12 billion tonnes** CO₂ per year (nearly 30% of global emissions), while the U.S. emits about **5 billion tonnes** (approximately 14% of global) ([68]) ([69]). U.S. emissions actually fell about 15% from 2005 to 2020, largely due to the shift from coal to gas and some growth in renewables, but have plateaued and ticked up in 2021–2022. China’s emissions rose sharply in the 2000s and 2010s, and are only now nearing a plateau. Per capita, U.S. emissions (~15 tons/person) are still about double China’s (~7–8 tons/person), reflecting historical differences in energy use and GDP per person.\n\n**Policy approach:** The contrast in strategies is often characterized as _“bottom-up vs top-down.”_ The U.S. relies on a mix of federal tax credits, state-level renewable portfolio standards (requiring utilities to supply X% renewables), and market competition. For instance, many U.S. states (especially California, Northeast states, Texas, etc.) have driven wind and solar growth through mandates or by having favorable markets. The federal Production Tax Credit (PTC) and Investment Tax Credit (ITC) have supported wind and solar for years, leading to significant cost declines. This decentralized approach has strengths (innovation, cost reductions, avoiding overbuild of unwanted capacity) but also weaknesses: projects can be stalled by local opposition or lengthy permitting (e.g., transmission lines or wind farms facing NIMBYism), and progress can be uneven across states. In contrast, China’s centrally planned approach sets national targets and directs state-owned enterprises to achieve them, often leading to rapid deployment. The downside can be inefficient allocation (e.g., building renewables in areas before adequate transmission is ready, causing curtailment) or debt buildup in state firms, but the upside is speed and scale.\n\nAnother difference is that China’s policy heavily integrated **domestic industrial development** – its renewable push was tied to creating domestic manufacturing giants (solar panels, wind turbines, batteries) through subsidies and protected markets, enabling it to dominate global supply chains ([40]) ([39]). The U.S., until recently, was content to let China lead manufacturing while the U.S. installed whatever was cheapest (often importing Chinese gear). The IRA marks a change: it includes incentives for _Made-in-America_ clean tech and has sparked announcements of new solar panel and battery factories in the U.S. This shows the U.S. trying to reclaim some supply chain and industrial share, learning from China’s model that linked climate action with economic strategy.\n\n**Grid and infrastructure:** Both countries face challenges upgrading their electricity grids. Ironically, China – an authoritarian system – sometimes struggles with provincial silos and bureaucracy in grid operations, which contributed to curtailment issues in the past (provinces not wanting to import power from neighbors, etc.). They addressed a lot of this by strengthening the national grid company and building UHV lines. The U.S., a federal system, faces fragmentation in terms of grid governance – multiple regional grid operators, and difficulties siting interstate transmission due to state and local jurisdictions. As a result, the U.S. has a notorious backlog of renewable projects waiting to connect to the grid (the “interconnection queue” problem). A key bottleneck for U.S. renewables now is getting enough new transmission built; studies show the U.S. may need to expand its transmission capacity by 60% or more by 2030 to hit climate targets. China’s advantage is that if Beijing decides a transmission line is needed, it can often build it faster (despite some issues with land acquisition). For example, China built tens of thousands of km of high-voltage lines in the 2010s, whereas the U.S. has built relatively few new long-distance lines in that period. This difference in infrastructure build-out speed is a significant contrast.\n\n### Electrification and Electric Vehicles\n\nAs detailed earlier, China leads in electric vehicle adoption. By 2023, **over 35%** of new cars in China were electric ([26]) ([70]), compared to about **7–8%** in the U.S. (approximately 1 million EVs sold out of ~13-14 million total U.S. light vehicle sales in 2023). The U.S. EV market is growing (2023 saw roughly a 50% increase from 2022, and EV share roughly doubled from about 4% in 2021 to ~8% in 2023), but it significantly lags China (and Europe, where EVs were ~20% of sales in 2023). Several factors explain this gap:\n\n- **Policy and incentives:** China’s government set EV targets early (back in 2009 it started supporting EV development) and offered generous consumer incentives and license plate advantages in cities (EVs could get plates easier than gas cars in places like Shanghai). The U.S. has had a federal EV tax credit (up to $7,500) but it was capped per manufacturer and only recently expanded (the IRA removed the cap and added conditions like North American assembly). State incentives in the U.S. vary; some states like California also offer rebates and, importantly, the Zero-Emission Vehicle (ZEV) mandate which requires automakers to sell a certain fraction of EVs. California’s rules (adopted by a coalition of states) will mandate only zero-emission new car sales by 2035. This is somewhat analogous to China’s NEV credit mandate for automakers. So policy support in the U.S. is strengthening now, but China had a decade head-start and more direct subsidy.\n    \n- **Market and industry:** U.S. consumers historically favored larger vehicles (trucks, SUVs) and cheap gasoline made EV economics tougher until recently. Chinese consumers had a different market – many first-time car buyers, receptive to smaller urban EVs, and often facing high fuel costs or restrictions on gas cars in cities. Chinese EV makers also focused on affordable models (the Wuling Mini, many models under $30k), whereas early EVs in the U.S. were mostly higher-end (Tesla, Chevy Bolt to some extent). Now the U.S. market is diversifying (Ford F-150 Lightning electric pickup, etc. to appeal to mainstream). Tesla, an American company, ironically sells more EVs in China than in the U.S. (China is Tesla’s biggest market for the Model Y/3). The U.S. auto industry only recently fully embraced EVs (e.g., GM announced plans to phase out gas cars by 2035, etc.).\n    \n- **Charging infrastructure:** China has over 10 times more public chargers than the U.S., making EV ownership more convenient there, especially for those without home charging. The U.S. is investing in a national charging network now (with funding from the 2021 Infrastructure Investment and Jobs Act for 500,000 chargers), but it will take time to catch up.\n    \n\nOutside of cars, China’s electrification of buses and two-wheelers far exceeds the U.S., where transit buses are only slowly switching to electric (but growing) and e-bikes are only beginning to catch on. The U.S. does not have the kind of electric public transit expansion that China has achieved – for example, Chinese cities like Shenzhen have **100% electric bus fleets**, whereas U.S. cities have small pilots. High-speed rail is another stark contrast: China’s high-speed rail network moves millions daily with electricity; the U.S. has virtually none (the Acela in the Northeast is a small piece). Instead, Americans rely on fuel-burning cars or planes for intercity travel. This is a missed opportunity both for convenience and emissions – one that the U.S. has struggled to address due to high costs and political opposition to rail projects.\n\nThe **net effect** is that China is reducing oil demand growth via electrification, whereas the U.S. transportation emissions are only just starting to bend downward. The Biden administration has proposed aggressive vehicle emissions standards that could push EVs to ~2/3 of U.S. new sales by 2032, which would significantly close the gap with China. But these regulations face legal and political challenges. As of now, the U.S. is catching up but remains behind China in electrification of transport.\n\n### Nuclear Energy: Divergent Paths and Missed Opportunities\n\n_Nuclear power_ provides an illuminating case of how China and the U.S. have diverged in their climate strategies. In the mid-20th century, the United States was the world leader in nuclear energy, pioneering commercial reactors and building dozens of plants (especially in the 1970s). China was a latecomer, only starting nuclear power in the 1990s. But today the situation is almost reversed: **China is rapidly expanding nuclear, while the U.S. nuclear sector is stagnating or contracting.** This has implications for each country’s ability to decarbonize and for industrial leadership in an important technology.\n\nAs of 2024, the United States still has the largest operating nuclear fleet by capacity – about **94 reactors totaling ~102 GW** ([71]). These reactors, however, are aging (most were built in the 1970s-80s). The U.S. has connected only one new nuclear plant in the past 25+ years – the Watts Bar unit 2 in 2016 – until this past year when two reactors (Vogtle-3 and Vogtle-4 in Georgia) finally came online in 2023 after years of delay. Meanwhile, a number of reactors have shut down prematurely in the last decade (due to economic pressure from cheap natural gas and lack of state support) – for example, California’s San Onofre in 2013, New York’s Indian Point in 2021. These closures have sometimes _raised_ emissions, as gas or coal filled the gap; New York saw a spike in carbon intensity after Indian Point’s closure, with the city’s grid becoming **“dirtier than Texas’s”** because gas replaced the lost carbon-free nuclear generation ([72]) ([73]). This illustrates a critical missed opportunity: retiring nuclear plants without replacement forfeits huge amounts of clean power. In New York’s case, one expert called it “a real step backwards” for climate goals ([74]).\n\nChina, by contrast, has been **building new nuclear plants at a steady clip**. By mid-2024, China had **58 GW of nuclear capacity in operation (around 55 reactors)**, just shy of France’s 64 GW and closing in on the U.S. in terms of electricity output ([75]) ([76]). Throughout the 2010s, China brought multiple reactors online each year, and it currently has **23 reactors under construction** (as of 2023) – the most of any country. In 2022 alone, China connected 3 new reactors to the grid and in 2023 connected 2 more, including the world’s first commercial **Generation IV** reactor (a high-temperature gas-cooled pebble-bed reactor, HTR-PM) ([77]). In August 2024, China approved a major batch of **11 new reactors** to begin construction (total ~$33 billion investment) in coastal provinces ([78]) ([79]). These are part of China’s plan to roughly double nuclear capacity by 2030. The 14th Five-Year Plan sets a goal of 70 GW nuclear by 2025 ([80]), which China may come close to (possibly ~65 GW by then), and internal targets point to **150+ GW by 2030**. If achieved, China would likely surpass the U.S. in total nuclear generation by the end of this decade ([81]) ([71]).\n\nThe approaches to nuclear also differ: The U.S. has had difficulties with cost overruns and regulatory hurdles for new reactors. The Vogtle plant expansion in Georgia (the only active new-build project in the U.S. in recent years) came in years late and billions over budget, which made U.S. utilities very wary of ordering new large reactors. No other large reactor projects are currently underway in the U.S. (though there are plans for a few small modular reactors later this decade). In China, construction costs are lower and times are faster, thanks in part to standardized designs and bulk building. China initially imported Western designs (e.g., Westinghouse AP1000 reactors) and then indigenized them. It developed its own Gen-III reactor, the **Hualong One**, which is now being built domestically and exported (to Pakistan, Argentina) ([82]). Four Hualong One units are operating in China with 13 more under construction ([83]). This shows China positioning itself as a global supplier of nuclear technology, a role the U.S. used to play. Moreover, China is investing in advanced nuclear: the HTR-PM mentioned is a small modular reactor prototype now in operation ([77]), and China is researching others (like molten salt reactors). The **innovation leadership** is tilting – China is at the _“forefront of advancing and implementing cutting-edge [nuclear] technologies”_, having mastered AP1000 construction and then improved upon it with domestic designs ([84]).\n\nFor the U.S., this relative decline of nuclear is a significant missed opportunity in climate strategy. U.S. nuclear plants today still produce about 20% of U.S. electricity and remain the largest source of carbon-free power in the country ([85]). Keeping them running is vital (thankfully, the U.S. has begun to support existing plants with credits in the bipartisan infrastructure law and IRA, preventing further premature shutdowns). But **expanding** nuclear could have helped the U.S. decarbonize faster. If the U.S. had built new reactors at the pace of, say, the 1980s or at China’s current pace, it could by now have replaced much of its retiring coal fleet with reliable, carbon-free nuclear energy. Instead, most replaced coal capacity in the U.S. has been taken up by natural gas – which, while cleaner than coal, is still a fossil fuel and emits CO₂ (albeit ~50% less per kWh than coal).\n\nThe causes of U.S. nuclear stagnation are multi-fold: public fear and opposition since accidents like Three Mile Island (1979) and Chernobyl (1986) made nuclear politically difficult; regulatory complexity and a lack of standardization drove up costs; the shale gas revolution made gas-fired power very cheap, undercutting the economics of new nuclear; and for a long time, climate policy did not specifically reward nuclear for its low-carbon attribute (renewables got more policy support). Some environmental groups even celebrated nuclear plant closures, focusing only on renewable energy – only to realize later that emissions increased as a result, a _“cautionary tale”_ as in New York ([86]).\n\nAnother aspect is **loss of U.S. leadership**: The U.S. originally designed the AP1000 reactor, but the only country to successfully build multiple AP1000s is China (four of them). The U.S. attempt (Vogtle) was costly. This transfer of know-how means countries looking for nuclear plants might turn to Russia or China for proven options, reducing U.S. influence in setting nuclear safety and nonproliferation norms. It also surrenders economic opportunities; nuclear projects are massive in scale and scope (steel, engineering, jobs, etc.).\n\nGiven the urgency of deep decarbonization, many experts argue the U.S. _needs_ to keep nuclear in its toolbox alongside renewables. For instance, the **IPCC** and International Energy Agency scenarios for 1.5°C often include significant nuclear expansion. Nuclear provides firm, dispatchable power that can complement variable wind and solar. Without it, reaching 100% clean electricity becomes harder (requiring huge overbuild of renewables plus storage). The U.S. government has started funding advanced reactor designs (small modular reactors (SMRs) like NuScale’s, or advanced concepts from TerraPower, etc.), but these won’t be deployed at scale until the 2030s at best. Meanwhile, preserving existing plants is the low-hanging fruit. The IRA created a production tax credit for existing nuclear to help economically. States like Illinois and New Jersey passed measures to save plants from closure. Those are positive steps.\n\nHowever, as of now, **China’s approach to nuclear stands in stark contrast**: it sees nuclear power as a cornerstone of its “green transition,” placing it alongside wind, solar, and hydro in its strategy to decarbonize heavy industry and the power sector ([78]) ([79]). China explicitly plans for nuclear to contribute a larger share of its electricity by 2035 (targeting ~10% from nuclear by 2035, up from ~5% now) ([87]). The U.S., on the other hand, has no official target to grow nuclear generation; at best, it aims to maintain or modestly increase it through advanced reactors.\n\nThe **missed opportunity** is clear when considering emissions: If the U.S. had not halted nuclear buildout after the 1980s, it could have many dozens of additional reactors today, displacing a significant portion of fossil generation. One study noted that _failing to use nuclear energy for climate mitigation_ has an opportunity cost – each nuclear plant not built means more emissions from fossil plants ([88]). For example, closing Indian Point’s two reactors (2 GW) removed 16 TWh of zero-carbon generation per year, which is now provided by gas plants – adding on the order of 4 million tons of CO₂ annually to New York’s emissions. That’s counterproductive for climate goals.\n\nIn a nutshell, **China is investing in nuclear as part of an “all of the above” decarbonization strategy, whereas the U.S. took a pause on nuclear and is only tentatively revisiting it now**. Bridging this gap could be crucial for the U.S. to meet its targets. The U.S. can glean lessons from both its own past and China’s present: standardize designs to get economies of series, streamline regulatory processes for proven designs, provide financing support (since nuclear plants are capital-intensive), and educate the public on nuclear’s safety record and climate benefits (modern reactors are very safe, and nuclear has far lower lifecycle mortality per kWh than coal, oil, or even biomass ([85])). There are signs of change – bipartisan support for advanced nuclear is growing, and companies are pursuing next-gen reactor demos. But time will tell if the U.S. can reboot its nuclear industry in time to aid its climate efforts.\n\n### Missed Opportunities and How the U.S. Can Improve\n\nBeyond nuclear, there are other **missed opportunities** in the U.S. approach that deserve mention. One is the lack of a consistent, economy-wide climate policy like a carbon price, which economists often recommend for efficiency. The U.S. has relied on piecemeal measures (tax credits, state rules), which can be less efficient and subject to reversal with changing administrations. Another is infrastructure build-out: e.g., the failure to build high-speed rail or robust public transit in many cities means Americans remain dependent on oil-fueled cars for mobility, making transportation the largest source of U.S. emissions. Additionally, until recently the U.S. was not investing enough in supply chains – meaning domestic manufacturing of solar panels, batteries, etc., was minimal, and the country became reliant on imports (with attendant vulnerabilities). The IRA and other moves (like the CHIPS Act for semiconductors, which also affects energy tech supply) are attempts to address this, essentially catching up to strategies China used (leveraging demand to also create local supply and jobs).\n\nIn terms of **shifting to a more effective strategy**, the U.S. can consider the following, drawing partly from China’s experience but adapted to American contexts:\n\n- **Scale up investment in the grid and storage:** The U.S. needs to upgrade its transmission network significantly to integrate renewable energy from regions where it’s plentiful (e.g., the windy plains, sunny Southwest) to centers of demand. Federal and state coordination to expedite transmission projects is crucial. The U.S. can also expand energy storage; pumped hydro potential exists in some locations, and battery storage installations are already increasing (the U.S. installed ~4 GW of battery storage in 2022, and much more is planned). Ensuring storage deployment keeps pace with renewables will improve reliability and reduce curtailment issues, as China is doing with its storage mandate.\n    \n- **Embrace an “all-of-the-above” clean energy portfolio:** Rather than pitting renewables against nuclear or other solutions, the U.S. should pursue multiple avenues. This means continuing the strong push on wind and solar (where it has abundant resources) – the IRA’s long-term credits provide a stable outlook for that. It also means developing and deploying **new nuclear** (e.g., help bring small modular reactors to market by funding first-of-a-kind plans and simplifying licensing) and exploring carbon capture for remaining fossil plants if needed. The U.S. is investing in carbon capture and hydrogen for decarbonizing industry; those should be accelerated where viable. Essentially, the U.S. can’t afford to rely on a single silver bullet; it needs renewable growth _and_ firm low-carbon power _and_ possibly carbon removal in the long run.\n    \n- **Learn from policy consistency:** One advantage China has is policy continuity – energy companies there know the direction is set (e.g., coal will eventually be phased down, clean energy will be favored). In the U.S., swings in federal policy (e.g., the previous administration rolled back climate measures, the current one re-instated them) create uncertainty. To be effective, climate strategy must be sustained over decades. The U.S. could benefit from establishing more durable frameworks – for instance, a clean electricity standard (CES) that gradually increases the required share of carbon-free electricity nationwide, which could survive political changes since utilities would plan around it. Some proposals for a U.S. CES or cap-and-invest have been made but not enacted. Alternatively, even using existing laws (like the EPA regulating power plant emissions) consistently would help.\n    \n- **Avoid false starts and focus on economic realism:** The U.S. should ensure its climate actions are grounded in economic feasibility. This means leveraging market forces (like how the IRA’s credits are spurring private investment) and avoiding unnecessarily costly approaches. For example, building new nuclear will require driving costs down; if costs remain exorbitant like Vogtle, it won’t be feasible. So a focus on **innovation and cost reduction** is key – an area where the U.S. historically excels (R&D). Essentially, the U.S. can aim to do what it did for shale gas (a technology revolution that made energy cheap) but for clean energy tech (like advanced geothermal, next-gen batteries, etc.). This aligns with arguments by some analysts (including even critics like Lomborg) that innovation is the way to make clean energy economically attractive ([89]) ([90]). The difference is, unlike Lomborg’s stance of waiting for a “magical new energy source” ([90]), the U.S. can actively invest to create those breakthroughs while deploying what is already cost-effective (solar, wind, etc.) immediately.\n    \n- **Address regulatory and permitting barriers:** A major improvement area is streamlining the permitting process for clean energy infrastructure. Many renewable projects and transmission lines get bogged down in reviews (sometimes taking 5-10 years). The U.S. could implement faster review timelines for low-impact renewable projects, designate national interest transmission corridors, and update zoning/building codes to promote things like rooftop solar and heat pumps. There is growing bipartisan awareness of “permitting reform” being needed. If done right (speeding up clean projects while still protecting the environment and communities), this could accelerate the transition significantly at lower cost.\n    \n- **Maintain focus on equity and workforce:** An economically sound strategy also considers workers and communities. For example, supporting retraining and new industries in coal-mining regions (where jobs will decline) is essential – something both the U.S. and China will grapple with. The U.S. has programs for a “Just Transition” in coal country (funds for Appalachian economic development, etc.), and China too has policies to retrain coal workers as mines close. Investing in people ensures the transition is politically sustainable.\n    \n\nIn comparing U.S. and China, it’s also worth noting **different areas of strength**: The U.S. has been a leader in innovation (for instance, breakthrough research in solar cells, batteries, and even nuclear designs often originates in the U.S.), whereas China’s strength has been in scaling up and driving costs down. An optimal global strategy would merge these strengths – e.g., U.S. innovation with Chinese scale – to achieve rapid and affordable decarbonization. Competition between the two can spur progress (as we see with EVs and solar manufacturing), but cooperation is also crucial (sharing best practices, jointly funding climate finance for poorer nations, etc.).\n\nIn conclusion on this section, both China and the U.S. are pivotal to global climate outcomes, but they are tackling the challenge in distinct ways. China’s approach is sweeping deployment and infrastructure build-out mandated from the top, including every major clean energy source (plus some continued fossil investment as a hedge). The U.S. approach is becoming one of market-driven growth aided by substantial incentives and innovation, but still faces internal political divides and structural hurdles. Each could learn from the other: China could benefit from some of the efficiency of U.S. markets and innovation (to avoid, say, wasted investments or overcapacity), and the U.S. could benefit from China’s sense of urgency and long-term planning (to not fall behind or miss targets due to short-term politics). Particularly on nuclear, the U.S. might re-examine its stance by looking at how quickly China has advanced nuclear technology when it treats it as a strategic priority. By making strategic adjustments – embracing a diverse clean energy mix, improving infrastructure, and maintaining consistent, cost-effective policies – the U.S. can move onto a faster track toward its climate goals, complementing China’s efforts and ensuring that both major economies are pulling their weight in the fight against climate change.\n\n## The Global Context: Developing Nations, Emissions, and Pathways to Growth\n\nNo analysis of climate action is complete without considering the broader global picture, especially the developing countries outside of the U.S. and China. These nations (in Asia, Africa, Latin America) are home to billions who aspire to higher living standards and will drive future energy demand. **Developing countries’ choices** in the coming decades will strongly influence global emission trajectories. Here we examine their current role, the expected increase in emissions with development, and strategies to enable their growth in a climate-friendly way. We also highlight how technology and cost trends (such as cheap solar) – many driven by China’s policies – can offer win-win solutions for development and decarbonization.\n\n### Emerging Emissions Giants: Today and Tomorrow\n\nHistorically, the developed world (U.S., Europe, Japan, etc.) emitted the bulk of CO₂ and thus has the largest share of CO₂ in the atmosphere. But this has been changing. **Since around 2015, developing countries as a group have overtaken developed countries in annual emissions** ([91]). China is considered a developing country in some contexts and is the single largest emitter, but even excluding China, other emerging economies are rising fast. For instance, **India** is now the 3rd largest emitter (~2.7 Gt CO₂/year), _though_ on a per capita basis it is only ~2 tons (far below the ~15 of the U.S. or ~7 of China). Regions like Southeast Asia and the Middle East have rapidly growing emissions (with countries like Indonesia, Vietnam, Saudi Arabia, etc. expanding energy use). **Africa** currently contributes only ~3–4% of global emissions, but with the fastest population growth and a huge need for energy access, its emissions could rise substantially in the second half of the century if following a fossil-heavy path.\n\nProjections show that **almost all the net growth in emissions going forward is expected to come from the developing world** under business-as-usual scenarios. One analysis looking at 2100 under current policies projected total global GHG emissions could be ~44 Gt by then, of which a staggering **36 Gt (≈82%) would come from non-OECD (developing) nations**, and only 8 Gt from OECD nations ([68]) ([69]). In other words, even if rich countries go to near-zero by late century, uncontrolled growth in poorer countries could push us far beyond climate targets (that scenario would yield ~2.8°C warming) ([69]). To meet a 2°C limit, developing countries would collectively need to massively cut their projected emissions – on the order of an 83% reduction from the baseline by 2100 ([92]) ([93]). This is a colossal challenge because these countries understandably prioritize economic growth and poverty alleviation. They “need to increase their energy consumption to improve living standards… yet they are also being asked to make the largest emissions reductions,” which indeed “seems very unfair” ([94]) ([95]).\n\nThe climate doesn’t care about fairness – physics cares only about total GHGs – but geopolitically, fairness matters a great deal. Developing nations point out that today’s climate problem was largely caused by past emissions of rich nations, and that they (developing countries) have a right to develop and use energy. Many are unwilling to sacrifice growth unless they receive support (financial and technological) to leapfrog to cleaner alternatives. This is the crux of international climate negotiations: providing $100+ billion per year in climate finance, technology transfer, etc., from developed to developing countries to facilitate a green transition. Unfortunately, support to date has been inadequate (the $100B/year promise by 2020 was not fully met, and future needs are in the trillions).\n\n### Strategies for Low-Carbon Development\n\nFor developing countries, the key is finding ways to meet their growing energy needs **without simply replicating the high-emissions path** that today’s rich countries took. This involves deploying cleaner alternatives that are economically attractive and reliable. Several strategies and technologies stand out:\n\n- **Leapfrogging Coal for Cleaner Alternatives:** In the 20th century, industrialization often meant building coal power plants because coal was the cheapest, most accessible fuel for many. Now, however, coal is no longer the default “cheapest” in many regions. Solar and wind costs have dropped dramatically – utility-scale solar is now the cheapest source of new electricity in a large number of countries (especially sunny ones) ([37]). Many developing nations have abundant solar irradiance and/or wind potential. By tapping these, they can add power capacity relatively cheaply and avoid some coal. For example, **India** has pivoted to a renewables-centric expansion: it set a 500 GW renewable capacity target by 2030 and is already the world’s fourth-largest in wind and solar. India still uses coal for base load and is building some new coal plants, but even there, solar often undercuts coal on price for new generation. **Vietnam** provides another example: it went from almost zero solar in 2017 to over 16 GW by 2020 through feed-in tariffs, surprising the world (and itself). That explosion of solar meant Vietnam canceled or delayed some coal projects. The lesson: if the economics are right and policies support it, developing countries can leapfrog to renewables for a portion of their growth.\n    \n- **Natural Gas as a Bridge (LNG over coal):** For countries that still need thermal power for stability or industrial processes, using **natural gas (LNG)** instead of coal can significantly cut emissions (about 50% less CO₂ per kWh) and reduce local pollution. Gas plants also pair well with intermittent renewables by providing flexible backup. Many experts see gas as a “transition fuel” for emerging economies: for instance, **Bangladesh, Vietnam, and others have shifted plans** to import LNG and build combined-cycle gas plants rather than new coal units. Gas is not zero-carbon, but it can be a pragmatic interim solution, especially where infrastructure for gas can be developed (port terminals, pipelines). The caveat is gas price volatility and energy security concerns (as Europe saw in 2022). But with a well-supplied global LNG market, countries can diversify away from heavy coal reliance. For example, **Pakistan** and **Bangladesh** have both been trying to increase LNG imports to displace expensive oil and inefficient coal in power generation, which helps emissions (though high LNG prices recently made it challenging for them). International development banks have been grappling with whether to fund gas projects in poor countries – some argue that barring gas funding is unfair and counterproductive if those countries then opt for coal instead ([96]) ([97]).\n    \n- **Affordable Solar and Batteries:** Thanks in large part to China’s manufacturing scale (and policies), as discussed, solar PV modules are far more affordable now than a decade ago ([39]). This is a game changer for many developing countries, where solar is becoming the go-to solution for rural electrification and for adding capacity quickly. **Africa** has huge solar potential – countries like Egypt, Morocco, Algeria, South Africa, and Kenya have begun installing large solar farms. The challenge is often financing and grid integration. But international initiatives (like the World Bank’s Scaling Solar program) have helped African nations procure solar at competitive rates. For instance, tenders in _Zambia_ and _Senegal_ have yielded solar PPAs (power purchase agreements) below $0.04/kWh, very cheap by historical standards. **Energy storage costs** (batteries) have also fallen (~85% decline in lithium-ion battery prices since 2010), which is crucial for enabling solar in weak grids or off-grid settings. Companies now offer solar-plus-battery microgrids that can bring 24/7 power to remote communities, cheaper and cleaner than diesel generators or extending the central grid. As these technologies get even cheaper (with ongoing innovation and scale – where China again is key as the largest battery producer), developing countries can increasingly choose renewables as the economically rational option, not just the green option.\n    \n- **Nuclear and Other Firm Power for Developing Nations:** Some developing countries are interested in **nuclear power** for long-term clean energy. However, traditional nuclear plants are large and costly, often beyond the reach of poorer nations without external help. Russia and China have been active in offering financing and construction of nuclear plants abroad (Russia built reactors in India, Bangladesh, is working in Egypt; China is in talks with Argentina, etc.). These projects can give countries reliable low-carbon power, but they come with geopolitical strings and require stable governance to manage safely. In the medium future, **small modular reactors (SMRs)** might be an attractive solution for developing regions – smaller, simpler plants that could be factory-built and shipped, with perhaps international operational support. If SMRs become commercial, a country without a big grid could deploy a 100 MW reactor for industrial or city power. The U.S., Canada, and others are working on SMR designs, as is China (which already built a demonstration). But cost and regulatory frameworks will determine if this is viable at scale. It’s a potential climate solution if made safe and affordable, especially for countries with limited renewable options or land (e.g., a nation like Bangladesh has limited land for solar/wind and is densely populated – an SMR or two could provide carbon-free power steadily).\n    \n- **Efficiency and Urban Planning:** Developing countries can also adopt efficiency measures and better urban planning to avoid high-emission lock-in. For example, building codes that encourage energy-efficient buildings, or planning cities around public transit rather than car dependency (learning from some mistakes of Western sprawl). This isn’t a technology per se, but a strategy to reduce future energy demand while improving quality of life. Some rapidly growing cities (like those in India or Nigeria) have a chance to build infrastructure in a climate-friendly way if supported.\n    \n\n**China’s role** with respect to developing nations is quite significant. China has positioned itself as a major financier and builder of infrastructure in the Global South via the **Belt and Road Initiative (BRI)**. In the past, this included financing many coal power plants abroad (particularly in Southeast Asia and South Asia) – which was a criticism as it exported high-emission tech. However, in 2021 China announced it _“will not build new coal-fired power projects abroad”_ ([98]). This was a landmark pledge. Since then, several Chinese-backed overseas coal projects have been canceled or converted; for example, China switched to funding renewable projects in some partner countries instead of coal. Now, Chinese companies are increasingly investing in solar, wind, and hydro projects internationally. **China’s dominance in solar manufacturing** means it’s the primary supplier of panels to almost all developing countries’ solar farms. By driving down solar costs 80%+ in the last decade, China in effect provided a _global public good_ – cheap renewable technology – that makes climate action easier for everyone. A commentary in _Yale E360_ noted _“the extraordinary scale of China's renewables output has driven down prices worldwide”_, which is “key” in reducing costs of climate mitigation ([99]) ([32]). This is a prime example of productive policy innovation: Chinese domestic policy (mass deployment, subsidies) led to innovation and scale that benefited the world by making an essential climate solution more accessible.\n\nIn the realm of finance, China (along with development banks) is also a major lender for hydroelectric dams (like ones in Africa and Southeast Asia) and is exploring becoming a leader in exporting nuclear plants (though that’s still nascent). Additionally, Chinese electric vehicle and battery makers are starting to expand abroad, which could bring affordable EVs to developing countries’ markets (for example, Chinese EV buses are being sold in Latin America and Africa, greening transit there).\n\nIt’s worth mentioning that other entities – like the World Bank, U.S. International Development Finance Corporation, etc. – are also trying to pivot funding toward clean energy in developing nations. There have been initiatives like the _Just Energy Transition Partnership (JETP)_ with South Africa (where Western nations pledged $8.5B to help South Africa move away from coal). Similar deals are being discussed with Indonesia, Vietnam, and others. These aim to provide targeted finance to retire coal plants early and replace them with cleaner options, while retraining workers. If scaled up, such partnerships could shave off a lot of future emissions in emerging economies by preventing new coal locks-in.\n\nTo summarize, developing nations are at the heart of the climate challenge moving forward. They have legitimate needs to expand energy access and industrialize, but doing so via fossil fuels would make climate goals unattainable. The silver lining is that renewable energy (solar/wind) and other tech are now much cheaper and more mature than when today’s rich countries developed – offering a chance to leapfrog. Key strategies include substituting coal with gas and renewables (LNG over coal, solar/wind wherever possible), employing new tech like SMRs or battery storage as they become viable, and securing climate finance so upfront costs are not a barrier. International cooperation is crucial: developed countries need to assist with funding and tech transfer, and large developing countries like China (and India) themselves have to lead by example and by support. China’s contribution in making solar affordable and scaling up manufacturing of batteries and EVs is a case in point – it has arguably done more to reduce future costs of decarbonization globally than any other single country. However, China also continues to finance some oil and gas infrastructure abroad (understandably given energy demands). Balancing development and climate is tough, but success stories are emerging – e.g., **renewable energy is now often the default choice** for new power in many developing markets because it’s cheapest, which was not the case 10 years ago. That is a profound shift, and one that gives hope that economic growth and climate mitigation can be aligned.\n\n## Conclusion: Toward Effective and Realistic Climate Action\n\nThe analysis above illustrates both the remarkable progress and the daunting challenges in meeting global climate goals. China, often criticized for its coal use, is nonetheless making transformative strides in building a green energy economy – investing in everything from massive solar farms to high-speed electric rail – at a scale that is moving the needle on global emissions trajectories. The United States, after years of slower action, is ramping up its efforts with new policies and innovations, but must overcome internal hurdles and missed opportunities (notably in nuclear energy and grid infrastructure) to truly lead by example. Developing nations are becoming the fulcrum on which climate success will pivot, and strategies to support their sustainable growth (like providing cheap clean technology and financing) are more critical than ever.\n\nA key takeaway is that **real-world climate progress is being driven by making clean solutions economically attractive and technologically viable**. China’s policy of subsidizing and scaling manufacturing lowered costs worldwide – this is a model of practical climate action that focuses on solutions rather than rhetoric. In contrast, approaches that are all talk or that rely on flawed analyses can mislead policymakers. For instance, Bjørn Lomborg’s _False Alarm_ argues against “climate panic” and costly immediate action, contending it’s better to invest in R&D and adaptation. While it is true that innovation and cost-effectiveness are important (and no serious policy should ignore economic reality), critics note that Lomborg’s work has **serious shortcomings in analytical rigor**. He often relies on cherry-picked data and models that vastly **underestimate the potential damage of climate change** and **overestimate the costs of mitigation** ([100]) ([101]). For example, Lomborg uses a model suggesting even 4°C of warming would only reduce global GDP by a few percent – an implausibly low impact that downplays risks of catastrophic outcomes ([101]) ([102]). He also inflates mitigation costs by arbitrarily doubling estimates ([102]), leading him to a conclusion that doing little is “optimal.” Such analysis has been labeled _“outdated, cherry-picked or just wrong”_ by experts ([100]). The danger is that it could encourage complacency by painting climate action as prohibitively expensive and climate impacts as mild – neither of which aligns with the bulk of scientific and economic evidence.\n\nOn the other end of the spectrum, overly doomist portrayals like David Wallace-Wells’ _The Uninhabitable Earth_ grab attention with worst-case scenarios of climate devastation. Wallace-Wells vividly describes possible horrors if warming runs away, which did serve to alarm readers – arguably spurring some to action. But scientists have critiqued that work for **focusing almost exclusively on extreme scenarios without clarifying their low probability**, and for containing some factual inaccuracies and a lack of nuance ([103]) ([104]). While alarm can be a motivator, there is a fine line where it becomes counterproductive if people view the future as hopelessly apocalyptic. The book’s title itself was somewhat misleading, as it doesn’t literally claim Earth will be uninhabitable, and the reality is more about parts of the planet becoming less habitable ([105]). The key critique is that _doom without solutions_ can lead to despair or fatalism, just as _denial or delay_ arguments can lead to inaction. Neither extreme offers a pragmatic path forward.\n\nThe real world path, as evidenced by China’s massive deployment or the U.S.’s technological ingenuity, lies in **urgent but practical action**. It’s about threading the needle between complacency and panic – acknowledging the gravity of climate change (it _is_ an existential threat that demands unprecedented action) while also charting a **feasible, economically sound route** to address it. The progress in renewables, batteries, and electrification over the past decade shows that aligned policy and market forces can yield fast results – often faster than anticipated. Ten years ago, many thought a coal-dependent country like China would never aggressively pivot to renewables; today, China leads the world in clean power capacity. Similarly, skeptics doubted EVs would go mainstream, yet now one in five cars sold globally is electric ([106]) ([26]). These shifts provide a counter-narrative to both the doomists and the do-nothings: **we are not doomed if we act, and acting need not wreck the economy – in fact, it can foster new industries and growth.**\n\nFor the United States and other developed countries, a crucial step is to overcome partisan divides and sustain climate policies as a long-term national priority (much as China treats it as part of its strategic planning). This includes investing in innovation (where the U.S. has strengths) but also in deployment and infrastructure (learning from China’s scaling). The U.S. can also capitalize on its democratic and market systems to engage private sector dynamism – for example, competition in EVs has brought dramatic innovation (Tesla, etc.), and now the Big Three automakers are joining, which will accelerate adoption. Ensuring that the regulatory environment rewards clean energy – through carbon pricing or clean standards – would guide the market more efficiently than a patchwork of subsidies alone. Essentially, making the _clean_ choice the _cheap_ and _easy_ choice is the endgame, and that requires both policy nudges and leveraging economies of scale.\n\nIn developing countries, the international community must step up support. It is heartening that some large emerging economies (like India, South Africa, Indonesia) are engaging in energy transition deals. But the scale needs to be larger. Investment in green infrastructure in developing nations could not only cut emissions but also drive economic development (e.g., solar mini-grids providing electricity in Africa enable businesses, education, healthcare improvements while avoiding diesel generators or deforestation). Multilateral development banks should be retooled to make climate action central to their portfolios – this is starting to happen, but slowly. China’s role here is double-edged: it’s providing a lot of finance, but there’s room for aligning BRI more fully with global climate goals and coordinating with others on standards and debt sustainability.\n\nFinally, reflecting on the climate discourse: Both _False Alarm_ and _The Uninhabitable Earth_ have sparked debate. The critiques of these works underscore that **effective climate strategy must be grounded in rigorous analysis and real-world feasibility**. Dismissing climate risks or delaying action based on skewed economics is dangerous – it runs contrary to the overwhelming evidence that the longer we wait, the costlier and harder it becomes to avoid the worst outcomes. Conversely, peddling only nightmare scenarios without discussing solutions or probabilities can paralyze or alienate people, when what’s needed is mobilization with hope and purpose. The middle path is one of **“alarmed realism”** – recognizing the serious risks (in truth, unchecked climate change _could_ make large parts of Earth gravely inhospitable, a fact that should alarm us) yet also recognizing that we have agency and a suite of tools to combat it. The progress in China, U.S. and elsewhere shows that when society chooses to act, it can bend emissions curves.\n\nIn sum, China is providing proof that a country can expand its economy and improve living standards while pivoting toward cleaner energy – albeit with contradictions that need resolving. The U.S. has every capability to do the same, if it musters the political will and forward-looking vision. Together, these two powers (along with other nations) can drive global innovation and cost reduction in climate solutions, from renewable energy to next-gen nuclear to carbon capture. The developing world stands to benefit immensely if those solutions are made accessible and affordable – they can skip to a cleaner future instead of recapitulating the dirty past. The research and data presented in this report support an overall climate strategy that is **ambitious yet practical**: massively scale up renewables and electrification (as China has done), don’t shy away from nuclear and other firm low-carbon sources (where the U.S. could re-engage leadership), use transitional fuels like gas where necessary to hasten coal’s decline, and crucially, collaborate internationally to ensure all countries have the means to follow a low-carbon development path.\n\nThe climate challenge is daunting, but not insurmountable. The world’s largest emitters are beginning to move – some faster than others – and the task now is to accelerate these actions, share successes, and correct shortcomings. Neither technological silver bullets nor doom-and-gloom resignation will save us; rather, **steady, determined implementation of a wide range of solutions**, guided by sound science and economics, will. The stories of the past few years – be it a coal-heavy China suddenly becoming a clean energy champion, or EVs overtaking gasoline models in market after market – show how quickly the tide can turn. With continued pressure and smart policy, we can hope to see a global tipping point where emissions finally peak and decline in time to preserve a livable planet. As the saying goes, “the best way to predict the future is to create it.” The world, led by major players like China and the U.S., is in the early chapters of creating a new, sustainable future – one where climate pledges are not just promises on paper, but tangible realities manifested in solar panels, wind turbines, electric vehicles, innovative reactors, and thriving green economies across all continents.\n\n**Sources:**\n\n- Centre for Research on Energy and Clean Air (CREA) and Global Energy Monitor reports on China’s coal plant permitting and clean energy progress ([2]) ([15])\n    \n- Reuters – **“China’s solar, wind power installations soared to record in 2024”** (Jan 21, 2025), detailing China’s 2024 capacity numbers ([27]) ([28])\n    \n- PV Magazine – **“Digging into China’s solar capacity numbers”** (Mar 28, 2025), on China reaching 1.4 TW wind+solar by end of 2024 ([30])\n    \n- Carbon Brief – **“Q&A: How China became the world’s leading market for energy storage”** (Jan 2025), on China’s storage growth and 44% clean electricity share ( [25] ) ( [24] )\n    \n- IEA Global EV Outlook 2024 – on EV sales shares (China >33% in 2023) ([26]) ([55])\n    \n- Guardian – **“A nuclear plant’s closure was hailed as a green win. Then emissions went up”** (Mar 20, 2024), on Indian Point closure increasing NYC emissions ([72])\n    \n- The Diplomat – **“China Will Generate More Nuclear Power Than... the US by 2030”** (Aug 28, 2024), on China’s nuclear expansion and technology leadership ([84]) ([77])\n    \n- The Guardian (Bob Ward) – review of _False Alarm_ and _Apocalypse Never_, on Lomborg’s misuse of data (cherry-picked sources, minimal damage estimates) ([100]) ([101])\n    \n- Climate Feedback – scientists’ evaluation of _“The Uninhabitable Earth”_ article, on its hyperbole and lack of context for worst-case scenarios ([103]) ([104])\n    \n- Resource Works – _“The Future of Emissions, Developing Nations, and the Path Forward”_ (2023), with projections of 36 Gt/8 Gt split between non-OECD vs OECD emissions by 2100 ([68]) ([69]).\n\n[1]: https://www.reuters.com/article/business/environment/china-doubles-new-renewable-capacity-in-2020-still-builds-thermal-plants-idUSKBN29Q0JS/#:~:text=China%20had%20vowed%20to%20increase,by%202030\n[2]: https://energyandcleanair.org/publication/china-permits-two-new-coal-power-plants-per-week-in-2022/#:~:text=,of%20two%20large%20coal%20power\n[3]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/#:~:text=China%20approved%2066,role%20in%20the%20power%20system\n[4]: https://energyandcleanair.org/publication/china-permits-two-new-coal-power-plants-per-week-in-2022/#:~:text=world%20combined.%20,86%20GW%20of%20new%20coal\n[5]: https://www.reuters.com/business/energy/chinas-2024-coal-power-construction-hits-10-year-high-researchers-say-2025-02-13/#:~:text=China%27s%202024%20coal%20power%20construction,the%20country%27s%20transition%20away\n[6]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/#:~:text=Note%3A%20In%202024%2C%2066,permits%20and%20started%20construction%20in\n[7]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/\n[8]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/#:~:text=Figure%20%E2%80%93%20Progress%20of%20new,projects%20and%20retirements%20in%20China\n[9]: https://energyandcleanair.org/publication/china-permits-two-new-coal-power-plants-per-week-in-2022/#:~:text=The%20massive%20additions%20of%20new,fired%20power%20generation\n[10]: https://energyandcleanair.org/publication/china-permits-two-new-coal-power-plants-per-week-in-2022/#:~:text=While%20China%20is%20making%20rapid,This%20could%20mean%20a%20major\n[11]: https://energyandcleanair.org/publication/china-permits-two-new-coal-power-plants-per-week-in-2022/#:~:text=Provided%20that%20growth%20in%20non,fired%20power%20generation\n[12]: https://www.reuters.com/article/business/environment/china-doubles-new-renewable-capacity-in-2020-still-builds-thermal-plants-idUSKBN29Q0JS/#:~:text=,of%20the%20Energy%20Foundation%20China\n[13]: https://energyandcleanair.org/publication/china-permits-two-new-coal-power-plants-per-week-in-2022/#:~:text=Even%20then%2C%20hundreds%20of%20brand,out%20of%20coal\n[14]: https://energyandcleanair.org/publication/china-permits-two-new-coal-power-plants-per-week-in-2022/#:~:text=overcoming%20the%20power%20system%20and,China%E2%80%99s%20climate%20commitments%20in%20danger\n[15]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/#:~:text=emerging%20as%20a%20key%20driver,entrenched%20reliance%20on%20fossil%20fuels\n[16]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/#:~:text=%E2%80%98establish%20before%20breaking%E2%80%99%20which%20envisions,how%20effectively%20renewables%20can%20reshape\n[17]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/#:~:text=Even%20as%C2%A0China%E2%80%99s%20clean%20energy%20surged,over%20the%20following%20five%20years\n[18]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/#:~:text=This%20reality%20makes%20it%20increasingly,how%20effectively%20renewables%20can%20reshape\n[19]: https://www.reuters.com/article/business/environment/china-doubles-new-renewable-capacity-in-2020-still-builds-thermal-plants-idUSKBN29Q0JS/\n[20]: https://www.reuters.com/business/energy/chinas-solar-wind-power-installed-capacity-soars-2024-2025-01-21/\n[21]: https://www.pv-magazine.com/2025/03/28/digging-into-chinas-solar-capacity-numbers/#:~:text=On%20Jan,leading%20solar%20status\n[22]: https://insideevs.com/news/481465/china-plugin-car-sales-december-2020/\n[23]: https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars\n[24]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=The%20deployment%20of%20%E2%80%9Cnew%20type%E2%80%9D,NEA\n[25]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=over%20all%20time\n[26]: https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars#:~:text=concentrated%20in%20just%20a%20few,global%20electric%20car%20stock%20is\n[27]: https://www.reuters.com/business/energy/chinas-solar-wind-power-installed-capacity-soars-2024-2025-01-21/#:~:text=There%20is%20now%20886,the%20International%20Renewable%20Energy%20Agency\n[28]: https://www.reuters.com/business/energy/chinas-solar-wind-power-installed-capacity-soars-2024-2025-01-21/#:~:text=By%202030%2C%20solar%20power%20capacity,said%20at%20a%20separate%20briefing\n[29]: https://www.reuters.com/article/business/environment/china-doubles-new-renewable-capacity-in-2020-still-builds-thermal-plants-idUSKBN29Q0JS/#:~:text=last%20month%20this%20figure%20would,by%202030\n[30]: https://www.pv-magazine.com/2025/03/28/digging-into-chinas-solar-capacity-numbers/#:~:text=Under%20the%20guidance%20of%20the,making%20future%20growth%20more%20challenging\n[31]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=energy%20and%20government%20efforts%20to,build%20a%20%E2%80%9Cnew%20power%20system%E2%80%9D\n[32]: https://e360.yale.edu/features/china-renewable-energy#:~:text=,doubled%20additional%20solar%20in%202023\n[33]: https://www.reuters.com/article/business/environment/china-doubles-new-renewable-capacity-in-2020-still-builds-thermal-plants-idUSKBN29Q0JS/#:~:text=China%2C%20the%20world%27s%20biggest%20greenhouse,NEA%29%20late%20Wednesday\n[34]: https://e360.yale.edu/features/china-renewable-energy#:~:text=Fossil%20fuels%20now%20make%20up,thirds%20of%20its%20power%20capacity\n[35]: https://www.reuters.com/business/energy/chinas-solar-wind-power-installed-capacity-soars-2024-2025-01-21/#:~:text=year%2C%20reaching%203\n[36]: https://www.pv-magazine.com/2025/03/28/digging-into-chinas-solar-capacity-numbers/#:~:text=reductions%20across%20the%20solar%20supply,to%2050\n[37]: https://www.pv-magazine.com/2025/03/28/digging-into-chinas-solar-capacity-numbers/#:~:text=China%E2%80%99s%20surge%20in%20solar%20installations,to%2050\n[38]: https://www.pv-magazine.com/2025/03/28/digging-into-chinas-solar-capacity-numbers/#:~:text=several%20factors,to%2050\n[39]: https://www.reuters.com/business/energy/china-solar-industry-faces-shakeout-rock-bottom-prices-persist-2024-04-03/#:~:text=Oversupply%20pushed%20prices%20of%20finished,Wood%20Mackenzie%20analyst%20Huaiyan%20Sun\n[40]: https://www.reuters.com/business/energy/china-solar-industry-faces-shakeout-rock-bottom-prices-persist-2024-04-03/#:~:text=China%20accounts%20for%2080,cost%20equipment\n[41]: https://www.reuters.com/business/energy/china-solar-industry-faces-shakeout-rock-bottom-prices-persist-2024-04-03/#:~:text=U,workers%20and%20the%20global%20economy\n[42]: https://www.reuters.com/business/energy/china-solar-industry-faces-shakeout-rock-bottom-prices-persist-2024-04-03/#:~:text=preserve%20market%20share%2C%20said%20Wood,Mackenzie%20analyst%20Huaiyan%20Sun\n[43]: https://energyandcleanair.org/publication/chinas-climate-transition-outlook-2023/#:~:text=China%E2%80%99s%20CO2%20emissions%20will%20increase,brought%20the%20emissions%20peak%20closer\n[44]: https://energyandcleanair.org/publication/chinas-climate-transition-outlook-2023/#:~:text=projected%20in%201.5,of%20the%20economic%20growth%20model\n[45]: https://www.eia.gov/todayinenergy/detail.php?id=57360#:~:text=New%20pumped,more%20than%20any%20other%20country\n[46]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=This%20has%20seen%20China%20become,batteries%2C%20quadrupled%20in%202023%20alone\n[47]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=Soaring%20battery%20deployment\n[48]: https://www.pv-magazine.com/2025/01/23/chinas-new-energy-storage-capacity-surges-to-74-gw-168-gwh-in-2024-up-130-yoy/#:~:text=China%27s%20new%20energy%20storage%20capacity,from%20the%20end%20of%202021\n[49]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=notably%20the%20gradual%20rollout%20since,%E6%96%B0%E8%83%BD%E6%BA%90%2B%E5%82%A8%E8%83%BD\n[50]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=he%20adds\n[51]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=Pumped%20hydro%20storage%20is%20the,the%20country%E2%80%99s%20overall%20storage%20capacity\n[52]: https://www.carbonbrief.org/qa-how-china-became-the-worlds-leading-market-for-energy-storage/#:~:text=The%20remaining%20half%20is%20comprised,as%20well%20as%20thermal%20energy\n[53]: https://www.reuters.com/business/energy/chinas-solar-wind-power-installed-capacity-soars-2024-2025-01-21/#:~:text=National%20Petroleum%20Company%20said%20at,a%20separate%20briefing\n[54]: https://www.reuters.com/business/energy/chinas-solar-wind-power-installed-capacity-soars-2024-2025-01-21/#:~:text=Last%20in%20August%2C%20China%27s%20state,demand%20on%20the%20national%20grid\n[55]: https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars#:~:text=In%20China%2C%20the%20number%20of,financial%20support%20remain%20in\n[56]: https://insideevs.com/news/481465/china-plugin-car-sales-december-2020/#:~:text=Image%3A%20external_image\n[57]: https://en.wikipedia.org/wiki/Electric_vehicle_industry_in_China#:~:text=Electric%20vehicle%20industry%20in%20China,\n[58]: https://www.statista.com/statistics/1331786/share-of-pure-electric-city-busses-and-trolleybusses-in-china/#:~:text=2016,cities%20were%20powered%20by%20electricity\n[59]: https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars#:~:text=main%20reason%20for%20growth%20in,led\n[60]: https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars#:~:text=as%20one%20of%20the%20key,higher\n[61]: https://energyandcleanair.org/publication/chinas-climate-transition-outlook-2023/#:~:text=China%E2%80%99s%20economic%20growth%20model%20shifted,keep%20China%E2%80%99s%20emission%20outlook%20uncertain\n[62]: https://energyandcleanair.org/publication/chinas-climate-transition-outlook-2023/#:~:text=The%20assessment%20found%20multiple%20indicators,that%20are%20on%20track\n[63]: https://energyandcleanair.org/publication/chinas-climate-transition-outlook-2023/#:~:text=capacity%20keep%20China%E2%80%99s%20emission%20outlook,uncertain\n[64]: https://energyandcleanair.org/publication/chinas-climate-transition-outlook-2023/#:~:text=CO2%20emissions%20rise%20but%20clean,energy%20surge%20brings%20peak%20closer\n[65]: https://www.rechargenews.com/energy-transition/china-smashed-records-for-new-wind-and-solar-in-2024/2-1-1767512#:~:text=China%20smashed%20records%20for%20new,Donald%20Trump\n[66]: https://www.statista.com/statistics/950342/china-accumulated-installed-wind-power-capacity/#:~:text=Wind%20power%20capacity%20in%20China,than%20threefold%20increase%20since%202014\n[67]: https://e360.yale.edu/features/china-renewable-energy#:~:text=When%20the%20International%20Energy%20Authority,quadruple%20additions%20of%20energy%20storage\n[68]: https://www.resourceworks.com/future-developing-nations#:~:text=Projections%20paint%20a%20depressing%20picture,set%20by%20the%20international%20community\n[69]: https://www.resourceworks.com/future-developing-nations#:~:text=billion%20tonnes,set%20by%20the%20international%20community\n[70]: https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars#:~:text=countries%2C%20electric%20cars%20account%20for,in%20terms%20of%20global%20trends\n[71]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=capacity\n[72]: https://www.theguardian.com/environment/2024/mar/20/nuclear-plant-closure-carbon-emissions-new-york#:~:text=nevertheless%20supplied%20a%20large%20chunk,free%20electricity\n[73]: https://www.theguardian.com/environment/2024/mar/20/nuclear-plant-closure-carbon-emissions-new-york#:~:text=Since%20the%20plant%E2%80%99s%20closure%2C%20it,well%20as%20the%20US%20average\n[74]: https://www.theguardian.com/environment/2024/mar/20/nuclear-plant-closure-carbon-emissions-new-york#:~:text=the%20US%20average%20am\n[75]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=According%20to%20the%20Global%20Energy,beginning%20of%20the%2021st%20century\n[76]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=Although%20the%20United%20States%20currently,it%20surpass%20the%20United%20States\n[77]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=Furthermore%2C%20China%20is%20at%20the,construction%20of%20nuclear%20power%20plants\n[78]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=On%20August%2019%2C%20during%20a,and%20building%20clean%20energy%20bases\n[79]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=Shandong%2C%20Guangdong%2C%20Zhejiang%2C%20and%20Guangxi%2C,and%20building%20clean%20energy%20bases\n[80]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=China%E2%80%99s%20nuclear%20power%20expansion%20is,largest%20nuclear%20power%20capacity\n[81]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=As%20of%20July%202024%2C%20China%E2%80%99s,by%202030\n[82]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=nuclear%20energy%20sector%2C%20China%20is,the%20HPR1000%20or%20Hualong%20One\n[83]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=Generation%20III%20reactor%2C%20the%20HPR1000,or%20Hualong%20One\n[84]: https://thediplomat.com/2024/08/china-will-generate-more-nuclear-power-than-both-france-and-the-united-states-by-2030/#:~:text=During%20the%20early%202000s%2C%20the,the%20HPR1000%20or%20Hualong%20One\n[85]: https://www.thefai.org/posts/what-s-holding-back-nuclear-in-america#:~:text=By%20now%20the%20data%20around,power%20in%20the%20United%20States\n[86]: https://www.theguardian.com/environment/2024/mar/20/nuclear-plant-closure-carbon-emissions-new-york#:~:text=embarrassing%20situation%20of%20seeing%20its,well%20as%20the%20US%20average\n[87]: https://www.newsecuritybeat.org/2024/05/dont-panic-us-chinas-nuclear-power-ascendancy-has-its-limits/#:~:text=Limits%20www,its%20electricity%20mix%20by%202035\n[88]: https://www.utilitydive.com/news/the-opportunity-cost-of-not-using-nuclear-energy-for-climate-mitigation/618137/#:~:text=The%20opportunity%20cost%20of%20not,its%20role%20as%20the\n[89]: https://www.theguardian.com/books/2020/aug/09/false-alarm-by-bjorn-lomborg-apocalypse-never-by-michael-shellenberger-review#:~:text=Lomborg%20is%20also%20right%20that,and%20cheaper%20than%20fossil%20fuels\n[90]: https://www.theguardian.com/books/2020/aug/09/false-alarm-by-bjorn-lomborg-apocalypse-never-by-michael-shellenberger-review#:~:text=match%20at%20L226%20Lomborg%20is,and%20cheaper%20than%20fossil%20fuels\n[91]: https://www.sciencedirect.com/science/article/pii/S2590332223000349#:~:text=Developing%20countries%27%20responsibilities%20for%20CO2,of%20developed%20countries%20since%202012\n[92]: https://www.resourceworks.com/future-developing-nations#:~:text=international%20community\n[93]: https://www.resourceworks.com/future-developing-nations#:~:text=To%20meet%20a%202%C2%B0C%20warming,This\n[94]: https://www.resourceworks.com/future-developing-nations#:~:text=They%20need%20to%20increase%20their,to%20their%20reliability%20and%20affordability\n[95]: https://www.resourceworks.com/future-developing-nations#:~:text=It%20may%20seem%20very%20unfair,overall%20levels%2C%20not%20their%20origin\n[96]: https://www.brookings.edu/articles/it-is-unfair-to-push-poor-countries-to-reach-zero-carbon-emissions-too-early/#:~:text=It%20is%20unfair%20to%20push,is%20both%20unfair%20and%20unviable\n[97]: https://www.cgdev.org/blog/climate-and-development-three-charts-update#:~:text=Climate%20Change%20and%20Development%20in,since%201850%20that%20have\n[98]: https://energyandcleanair.org/publication/when-coal-wont-step-aside-the-challenge-of-scaling-clean-energy-in-china/#:~:text=Even%20as%C2%A0China%E2%80%99s%20clean%20energy%20surged,2021%20pledge%20to%20phase%20down\n[99]: https://e360.yale.edu/features/china-renewable-energy#:~:text=How%20China%20Became%20the%20World%27s,in%20reducing%20the%20cost\n[100]: https://www.theguardian.com/books/2020/aug/09/false-alarm-by-bjorn-lomborg-apocalypse-never-by-michael-shellenberger-review#:~:text=Both%20books%20contain%20many%20pages,picked%20or%20just%20wrong\n[101]: https://www.theguardian.com/books/2020/aug/09/false-alarm-by-bjorn-lomborg-apocalypse-never-by-michael-shellenberger-review#:~:text=A%20graph%20in%20Lomborg%E2%80%99s%20book,hard%20to%20reconcile%20with%20the\n[102]: https://www.theguardian.com/books/2020/aug/09/false-alarm-by-bjorn-lomborg-apocalypse-never-by-michael-shellenberger-review#:~:text=Lomborg%20also%20exaggerates%20the%20costs,states%20to%20cut%20their%20collective\n[103]: https://climatefeedback.org/evaluation/scientists-explain-what-new-york-magazine-article-on-the-uninhabitable-earth-gets-wrong-david-wallace-wells/#:~:text=Daniel%20Swain%2C%20Climate%20Scientist%2C%20University,based%20upon%20existing%20scientific%20evidence\n[104]: https://climatefeedback.org/evaluation/scientists-explain-what-new-york-magazine-article-on-the-uninhabitable-earth-gets-wrong-david-wallace-wells/#:~:text=In%20addition%2C%20the%20article%20contains,knowledge%2C%20not%20substantiated%20by%20research\n[105]: https://www.theguardian.com/books/2019/feb/17/david-wallace-wells-uninhabitable-earth-review#:~:text=exaggeration,paragraphs%20of%20the%20book%20burn\n[106]: https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars#:~:text=,sold%20in%202023%20was%20electric",
    "tags": [
      "Article"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/thumbnails/climate-change.avif",
    "width": "medium"
  },
  {
    "slug": "minecraft",
    "title": "<article title=\"mc.dhugs.com\">",
    "date": "2025-01-01T05:00:00.000Z",
    "excerpt": "Personalized Minecraft Hosting: A cost-efficient, secure solution blending Cloudflare's reliable web hosting and the Pyrodactyl panel for streamlined Minecraft server management.",
    "content": "## Personalized Minecraft Hosting\n\nAfter several years of experimenting with hosting Minecraft servers and diving into the fundamentals of web hosting, I’ve finally created an experience I’m proud of. The best part? The only recurring cost is the domain name, which is about $1 a month.\n\nWith dhugs.com, I’ve combined a reliable web hosting setup using Cloudflare Pages with the innovative Pyrodactyl panel for Minecraft server management. Let’s dive into the details.\n\n---\n\n## Hosting Infrastructure\n\nI’m hosting dhugs.com on Cloudflare Pages, details of which you can find on [dhugs-com](https://github.com/declanhuggins/dhugs-com).\nThe minecraft servers run on a pair of Ubuntu 24.04 LTS servers with the following specs:\n\n- 24 GB RAM\n- 4 CPU cores\n- 200 GB storage\n- ARM-based architecture\n\n### Server 1: panel.dhugs.com\n\nThe first machine runs:\n\n- **Pyrodactyl Panel**: A modern game server management panel based on Pterodactyl, optimized for performance and usability. It runs on Caddy, a fast and secure web server.\n\n### Server 1+2: Game Server Hosting (mc.dhugs.com + mc.afrotc.com)\n\nBoth machines run:\n\n- **Minecraft Server**: Managed as a Docker container (Pterodactyl wing) preloaded with Java 21. This setup allows easy backups, server resets, and custom server environments.\n- **Additional Features:**\n  - Reverse-proxied [BlueMap](https://map.dhugs.com) mod for real-time server maps with player locations for mc.dhugs.com.\n  - Full TLS/SSL encryption using Caddy for all subdomains.\n  - Weekly auto-restarting of the server.\n\n---\n\n## Cloudflare DNS and Networking Setup\n\nI’ve configured Cloudflare DNS to streamline my hosting setup, as shown in the attached image. Here’s how it all works:\n\n### Website and Email\n\n- **A Records & CNAMEs**: dhugs.com and www.dhugs.com point to the Cloudflare Pages site.\n- **Development Site** dev.dhugs.com builds commits from the `dev` branch of the repository.\n- **Vanity Email**: MX and TXT records allow a custom email without the hassle of running my own mail server.\n\n### Minecraft and Panel\n\n- **panel.dhugs.com**: Hosts the Pyrodactyl management panel, allowing web-based server management.\n- **mc.dhugs.com**: Connects players directly to the Minecraft server. This subdomain is unproxied since Cloudflare’s free proxy only supports ports 80 and 443, while Minecraft’s default port (25565) requires direct access.\n- **map.dhugs.com**: Displays a live, interactive map of the Minecraft world using BlueMap.\n\n### Why These Choices?\n\n- **Unproxied SSH Access**: Some subdomains remain unproxied to allow straightforward SSH connections.\n- **TLS/SSL for Secure Connections**: Cloudflare’s HTTPS encryption ensures all communication between the panel and its nodes is secure.\n- **Cost Efficiency**: Using Cloudflare’s free plan avoids extra costs for forwarding Minecraft traffic while still ensuring protection of web servers.\n\n---\n\n## The Minecraft Experience\n\n### Seamless Modpack and Compatibility\n\n- Structure and Terrain Enhancements: Elevates the exploration and gameplay experience.\n- Server-Side Optimizations: Ensures blazing-fast performance with minimal lag.\n- Voice Chat Support: The server includes a voice chat mod for enhanced communication and teamwork.\n\n### Real-Time Map Viewer\n\n- Real-time updates\n- Player locations\n- Full SSL/TLS encryption for a seamless browsing experience\n\n---\n\n## A Professional Setup for Everyone\n\nThe Pyrodactyl panel makes it easy to manage servers with a polished interface and advanced features. I’ve even set up a similar system for a friend, allowing them to manage their server with separate credentials on the same panel. It’s a professional, scalable solution that showcases the flexibility of this setup.\n\nI’m also open to a bring-your-own-server setup. This means you can:\n\n- Utilize dhugs.com subdomains for Minecraft server joining.\n- Manage your server effortlessly through panel.dhugs.com without worrying about the technical setup—I’ll handle everything for you.\n\nJoin the dhugs.com Minecraft server today and experience a blend of cutting-edge hosting, exciting gameplay, and thoughtful optimization. Whether you’re here to explore, build, or just hang out, this server has something for everyone!\n\n&lt;/article&gt;\n",
    "tags": [
      "Article"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/thumbnails/minecraft.avif",
    "width": "medium"
  },
  {
    "slug": "resume",
    "title": "Resume",
    "date": "2025-01-01T05:00:00.000Z",
    "excerpt": "Updated resume highlighting technical expertise in IT and audiovisual support, academic achievements in Computer Science, and dynamic leadership in extracurricular activities.",
    "content": "\n**Email:** [declan@dhugs.com](mailto:declan@dhugs.com) | **LinkedIn:** [linkedin.com/in/DeclanHuggins](https://linkedin.com/in/DeclanHuggins)\n\n---\n\n## Education\n\n**University of Notre Dame** – Notre Dame, IN  \n*Bachelor of Science in Computer Science*  \n**Graduation:** May 2028  \n**GPA:** 3.6+\n\n---\n\n## Experience\n\n### IT Technician  \n**Fenwick High School** – Oak Park, IL  \n*June 2024 – August 2024*  \n- Identified and reported network vulnerabilities, enhancing cybersecurity measures for the school’s IT infrastructure.  \n- Provided technical support for hardware and software issues, ensuring minimal disruption to daily operations.  \n- Assisted in deploying and configuring new devices, including workstations, 30+ projectors, and network equipment.\n\n### Audio/Visual Technician  \n**West Suburban Temple Har Zion** – River Forest, IL  \n*June 2021 – August 2024*  \n- Managed professional sound systems for live events, ensuring high-quality audio for in-person and remote attendees.  \n- Live-streamed multi-angle video feeds on platforms including Zoom, YouTube, and Facebook.  \n- Troubleshot and resolved technical issues during live events to maintain uninterrupted A/V experiences.\n\n---\n\n## Leadership and Activities\n\n### Bravo Flight PA/PO Officer  \n**Air Force ROTC Detachment 225** – Notre Dame, IN  \n*August 2024 – Present*  \n- Captured and organized high-quality photographs from flight activities, including Morale, Welfare, and Recreation (MWR) and service events for social media.  \n- Coordinated with cadre and cadets to ensure timely and accurate event coverage.  \n- Orchestrated cadet photo sessions for detachment records and media.\n\n### Photographer  \n**The Observer** – Notre Dame, IN  \n*September 2024 – Present*  \n- Captured high-quality photographs for news stories covering campus events, student life, and community issues.  \n- Collaborated with journalists and editors to visually enhance stories for print and online publication.  \n- Delivered photos on tight deadlines, contributing to the newspaper’s timely and professional reporting.\n\n---\n\n## Related Coursework or Projects\n\n### Engineering Design  \n**University of Notre Dame**  \n*August 2024 – December 2024*  \n- Designed and prototyped a sensor housing system to monitor outdoor air quality, addressing environmental challenges such as air pollution.  \n- Utilized SolidWorks for 3D modeling and collaborated in a team of four to iteratively develop a sensor housing with an actuated opening for air sample collection using an Arduino-based microcontroller.\n\n### Candidate  \n**Arnold Air Society - Benjamin Foulois Squadron** – Notre Dame, IN  \n*September 2024 – Present*  \n- Collaborated on planning and executing the Arnold Air Society Service Event at Dismas House, fostering community engagement and supporting individuals transitioning from incarceration.  \n- Facilitated logistics for the event, including volunteer recruitment, transportation arrangements, and supply management.\n\n---\n\n## Technical and Language Skills\n\n- Developed personal AI projects using tools like Stable Diffusion and Jupyter Notebooks; created workflows involving image generation and voice synthesis.  \n- Proficient in **Python, Java, Lua, and C++**.  \n- Experienced with **AWS, Linode, DigitalOcean, and Oracle Cloud**.  \n- Proficient with **Windows, Mac OS, and Linux (Arch and Ubuntu)** environments.",
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/thumbnails/resume.avif",
    "width": "medium"
  },
  {
    "slug": "dec-20",
    "title": "Dec 20",
    "date": "2024-12-21T04:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Notre Dame",
      "Football"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/12/dec-20/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "nov-17",
    "title": "Nov 17",
    "date": "2024-11-18T04:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Notre Dame",
      "Dunne Hall",
      "Football"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/11/nov-17/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "oct-20",
    "title": "Oct 20",
    "date": "2024-10-21T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Dunne Hall"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/10/oct-20/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "sep-28",
    "title": "Sep 28",
    "date": "2024-09-29T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Notre Dame",
      "Football"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/09/sep-28/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "sep-20",
    "title": "Sep 20",
    "date": "2024-09-21T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Notre Dame",
      "Dunne Hall",
      "Football"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/09/sep-20/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "sep-10",
    "title": "Sep 10",
    "date": "2024-09-11T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Notre Dame",
      "AFROTC"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/09/sep-10/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "aug-31",
    "title": "Aug 31",
    "date": "2024-09-01T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Notre Dame",
      "Rugby"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/08/aug-31/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "aug-29",
    "title": "Aug 29",
    "date": "2024-08-30T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Notre Dame",
      "AFROTC",
      "Basketball"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/08/aug-29/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "jul-17",
    "title": "Jul 17",
    "date": "2024-07-18T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Football"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/07/jul-17/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "may-10",
    "title": "May 10",
    "date": "2024-05-11T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Fenwick"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/05/may-10/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "apr-19",
    "title": "Apr 19",
    "date": "2024-04-20T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Fenwick",
      "Rugby"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/04/apr-19/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "apr-16",
    "title": "Apr 16",
    "date": "2024-04-17T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Fenwick",
      "Rugby"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/04/apr-16/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "mar-27",
    "title": "Mar 27",
    "date": "2024-03-28T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Fenwick"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/03/mar-27/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "mar-16",
    "title": "Mar 16",
    "date": "2024-03-17T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Fenwick",
      "Rugby"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2024/03/mar-16/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "nov-18",
    "title": "Nov 18",
    "date": "2023-11-19T04:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Notre Dame",
      "Football"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2023/11/nov-18/thumbnail.avif",
    "width": "large"
  },
  {
    "slug": "sep-21",
    "title": "Sep 21",
    "date": "2023-09-22T03:59:00.000Z",
    "excerpt": "",
    "content": "",
    "tags": [
      "Photography",
      "Fenwick"
    ],
    "author": "Declan Huggins",
    "thumbnail": "https://cdn.dhugs.com/medium/albums/2023/09/sep-21/thumbnail.avif",
    "width": "large"
  }
]